In [133]:
import sqlite3
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn, query1):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
   
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main(query1):
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn, query1)

Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do.

In [134]:
query1="SELECT * FROM Members"
main(query1)

2.6.0
2. Query all tasks
(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', '', '2012-07-01 00:00:00')
(1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', '', '2012-07-02 12:02:05')
(2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', '', '2012-07-02 12:08:23')
(3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', '', '2012-07-03 09:32:15')
(4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', '1', '2012-07-03 10:25:05')
(5, 'Butters', 'Gerald', '1065 Huntingdon Avenue, Boston', 56754, '(844) 078-4130', '1', '2012-07-09 10:44:09')
(6, 'Tracy', 'Burton', '3 Tunisia Drive, Boston', 45678, '(822) 354-9973', '', '2012-07-15 08:52:55')
(7, 'Dare', 'Nancy', '6 Hunting Lodge Way, Boston', 10383, '(833) 776-4001', '4', '2012-07-25 08:59:12')
(8, 'Boothe', 'Tim', '3 Bloomsbury Close, Reading, 00234', 234, '(811) 433-2547', '3', '2012-07-25 16:02:35')
(9, 'Stibbons', 'Ponder', '5 Dragons Way, Winchester', 87630, '(833) 160-3900', '6', '2012-07-25 17:09:05')
(10, 'Owen', 'Charles', '52 Cheshire Grove, Winchester, 28563', 28563, '(855) 542-5251', '1', '2012-08-03 19:42:37')
(11, 'Jones', 'David', '976 Gnats Close, Reading', 33862, '(844) 536-8036', '4', '2012-08-06 16:32:55')
(12, 'Baker', 'Anne', '55 Powdery Street, Boston', 80743, '844-076-5141', '9', '2012-08-10 14:23:22')
(13, 'Farrell', 'Jemima', '103 Firth Avenue, North Reading', 57392, '(855) 016-0163', '', '2012-08-10 14:28:01')
(14, 'Smith', 'Jack', '252 Binkington Way, Boston', 69302, '(822) 163-3254', '1', '2012-08-10 16:22:05')
(15, 'Bader', 'Florence', '264 Ursula Drive, Westford', 84923, '(833) 499-3527', '9', '2012-08-10 17:52:03')
(16, 'Baker', 'Timothy', '329 James Street, Reading', 58393, '833-941-0824', '13', '2012-08-15 10:34:25')
(17, 'Pinker', 'David', '5 Impreza Road, Boston', 65332, '811 409-6734', '13', '2012-08-16 11:32:47')
(20, 'Genting', 'Matthew', '4 Nunnington Place, Wingfield, Boston', 52365, '(811) 972-1377', '5', '2012-08-19 14:55:55')
(21, 'Mackenzie', 'Anna', '64 Perkington Lane, Reading', 64577, '(822) 661-2898', '1', '2012-08-26 09:32:05')
(22, 'Coplin', 'Joan', '85 Bard Street, Bloomington, Boston', 43533, '(822) 499-2232', '16', '2012-08-29 08:32:41')
(24, 'Sarwin', 'Ramnaresh', '12 Bullington Lane, Boston', 65464, '(822) 413-1470', '15', '2012-09-01 08:44:42')
(26, 'Jones', 'Douglas', '976 Gnats Close, Reading', 11986, '844 536-8036', '11', '2012-09-02 18:43:05')
(27, 'Rumney', 'Henrietta', '3 Burkington Plaza, Boston', 78533, '(822) 989-8876', '20', '2012-09-05 08:42:35')
(28, 'Farrell', 'David', '437 Granite Farm Road, Westford', 43532, '(855) 755-9876', '', '2012-09-15 08:22:05')
(29, 'Worthington-Smyth', 'Henry', '55 Jagbi Way, North Reading', 97676, '(855) 894-3758', '2', '2012-09-17 12:27:15')
(30, 'Purview', 'Millicent', '641 Drudgery Close, Burnington, Boston', 34232, '(855) 941-9786', '2', '2012-09-18 19:04:01')
(33, 'Tupperware', 'Hyacinth', '33 Cheerful Plaza, Drake Road, Westford', 68666, '(822) 665-5327', '', '2012-09-18 19:32:05')
(35, 'Hunt', 'John', '5 Bullington Lane, Boston', 54333, '(899) 720-6978', '30', '2012-09-19 11:32:45')
(36, 'Crumpet', 'Erica', 'Crimson Road, North Reading', 75655, '(811) 732-4816', '2', '2012-09-22 08:36:38')
(37, 'Smith', 'Darren', '3 Funktown, Denzington, Boston', 66796, '(822) 577-3541', '', '2012-09-26 18:08:45')

In [135]:
query2= "SELECT * FROM facilities WHERE membercost > 0;"
main(query2)

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)

Q2: How many facilities do not charge a fee to members?

In [25]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT COUNT(name) FROM facilities WHERE membercost = 0;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

   COUNT(name)
0            4

Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

In [27]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT * FROM facilities WHERE membercost > 0 and membercost < (.2 * monthlymaintenance);"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

   facid            name  membercost  guestcost  initialoutlay  \
0      0  Tennis Court 1         5.0       25.0          10000
1      1  Tennis Court 2         5.0       25.0           8000
2      4  Massage Room 1         9.9       80.0           4000
3      5  Massage Room 2         9.9       80.0           4000
4      6    Squash Court         3.5       17.5           5000

   monthlymaintenance
0                 200
1                 200
2                3000
3                3000
4                  80

Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator.

In [29]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT * FROM facilities WHERE facid in (1,5);"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

   facid            name  membercost  guestcost  initialoutlay  \
0      1  Tennis Court 2         5.0         25           8000
1      5  Massage Room 2         9.9         80           4000

   monthlymaintenance
0                 200
1                3000

Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question.

In [45]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT name, monthlymaintenance, CASE WHEN monthlymaintenance > 100 THEN 'expensive' ELSE 'cheap' END \
AS Quality FROM facilities;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

              name  monthlymaintenance    Quality
0   Tennis Court 1                 200  expensive
1   Tennis Court 2                 200  expensive
2  Badminton Court                  50      cheap
3     Table Tennis                  10      cheap
4   Massage Room 1                3000  expensive
5   Massage Room 2                3000  expensive
6     Squash Court                  80      cheap
7    Snooker Table                  15      cheap
8       Pool Table                  15      cheap

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution.

In [148]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT DISTINCT firstname, surname, joindate FROM members WHERE joindate= (SELECT MAX(joindate) from members) \
ORDER BY joindate DESC;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

  firstname surname             joindate
0    Darren   Smith  2012-09-26 18:08:45

Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.

In [100]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT DISTINCT name , (surname || ', ' || firstname) AS member_name from Bookings LEFT JOIN Facilities using(facid) \
LEFT JOIN Members using(memid) WHERE facid in (0,1) AND memid != 0 ORDER BY surname, firstname, name;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

              name         member_name
0   Tennis Court 1     Bader, Florence
1   Tennis Court 2     Bader, Florence
2   Tennis Court 1         Baker, Anne
3   Tennis Court 2         Baker, Anne
4   Tennis Court 1      Baker, Timothy
5   Tennis Court 2      Baker, Timothy
6   Tennis Court 1         Boothe, Tim
7   Tennis Court 2         Boothe, Tim
8   Tennis Court 1     Butters, Gerald
9   Tennis Court 2     Butters, Gerald
10  Tennis Court 1        Coplin, Joan
11  Tennis Court 1      Crumpet, Erica
12  Tennis Court 1         Dare, Nancy
13  Tennis Court 2         Dare, Nancy
14  Tennis Court 1      Farrell, David
15  Tennis Court 2      Farrell, David
16  Tennis Court 1     Farrell, Jemima
17  Tennis Court 2     Farrell, Jemima
18  Tennis Court 1    Genting, Matthew
19  Tennis Court 1          Hunt, John
20  Tennis Court 2          Hunt, John
21  Tennis Court 1        Jones, David
22  Tennis Court 2        Jones, David
23  Tennis Court 1      Jones, Douglas
24  Tennis Court 1    Joplette, Janice
25  Tennis Court 2    Joplette, Janice
26  Tennis Court 1       Owen, Charles
27  Tennis Court 2       Owen, Charles
28  Tennis Court 1       Pinker, David
29  Tennis Court 2  Purview, Millicent
30  Tennis Court 1         Rownam, Tim
31  Tennis Court 2         Rownam, Tim
32  Tennis Court 2   Rumney, Henrietta
33  Tennis Court 1   Sarwin, Ramnaresh
34  Tennis Court 2   Sarwin, Ramnaresh
35  Tennis Court 2       Smith, Darren
36  Tennis Court 1         Smith, Jack
37  Tennis Court 2         Smith, Jack
38  Tennis Court 1        Smith, Tracy
39  Tennis Court 2        Smith, Tracy
40  Tennis Court 1    Stibbons, Ponder
41  Tennis Court 2    Stibbons, Ponder
42  Tennis Court 1       Tracy, Burton
43  Tennis Court 2       Tracy, Burton

Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.

In [152]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT name, (firstname || ' ' || surname) AS member_name, CASE WHEN memid = 0 THEN \
slots * guestcost ELSE slots * membercost END AS cost FROM Bookings LEFT JOIN Facilities using(facid) LEFT JOIN Members \
using(memid) WHERE starttime LIKE '2012-09-14%' AND cost > 30 ORDER BY cost DESC;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

              name     member_name   cost
0   Massage Room 2     GUEST GUEST  320.0
1   Massage Room 1     GUEST GUEST  160.0
2   Massage Room 1     GUEST GUEST  160.0
3   Massage Room 1     GUEST GUEST  160.0
4   Tennis Court 2     GUEST GUEST  150.0
5   Tennis Court 1     GUEST GUEST   75.0
6   Tennis Court 1     GUEST GUEST   75.0
7   Tennis Court 2     GUEST GUEST   75.0
8     Squash Court     GUEST GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court     GUEST GUEST   35.0
11    Squash Court     GUEST GUEST   35.0

Q9: This time, produce the same result as in Q8, but using a subquery.

In [153]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT name, (firstname || ' ' || surname) AS member_name, CASE WHEN memid = 0 THEN slots * guestcost ELSE \
slots * membercost END AS cost FROM (SELECT * FROM Bookings WHERE starttime LIKE '2012-09-14%') \
LEFT JOIN Facilities using(facid) LEFT JOIN Members using(memid) WHERE (memid = 0 and slots * guestcost > 30) or \
(memid != 0 and slots * membercost > 30)  ORDER BY cost DESC;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

              name     member_name   cost
0   Massage Room 2     GUEST GUEST  320.0
1   Massage Room 1     GUEST GUEST  160.0
2   Massage Room 1     GUEST GUEST  160.0
3   Massage Room 1     GUEST GUEST  160.0
4   Tennis Court 2     GUEST GUEST  150.0
5   Tennis Court 1     GUEST GUEST   75.0
6   Tennis Court 1     GUEST GUEST   75.0
7   Tennis Court 2     GUEST GUEST   75.0
8     Squash Court     GUEST GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court     GUEST GUEST   35.0
11    Squash Court     GUEST GUEST   35.0

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [81]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT name, sum(CASE WHEN memid = 0 THEN slots * guestcost ELSE slots * membercost END) AS revenue \
FROM Bookings LEFT JOIN Facilities using(facid) GROUP BY name HAVING revenue < 1000;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

            name  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [110]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT (a.surname || ', ' || a.firstname) AS members, (b.surname || ', ' || b.firstname) \
AS recommended_by FROM Members AS a, Members AS b WHERE a.recommendedby != 0 and a.recommendedby = b.memid ORDER BY \
b.surname, b.firstname;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

                     members      recommended_by
0          Sarwin, Ramnaresh     Bader, Florence
1               Coplin, Joan      Baker, Timothy
2           Genting, Matthew     Butters, Gerald
3             Baker, Timothy     Farrell, Jemima
4              Pinker, David     Farrell, Jemima
5          Rumney, Henrietta    Genting, Matthew
6             Jones, Douglas        Jones, David
7                Dare, Nancy    Joplette, Janice
8               Jones, David    Joplette, Janice
9                 Hunt, John  Purview, Millicent
10               Boothe, Tim         Rownam, Tim
11          Joplette, Janice       Smith, Darren
12           Butters, Gerald       Smith, Darren
13             Owen, Charles       Smith, Darren
14               Smith, Jack       Smith, Darren
15           Mackenzie, Anna       Smith, Darren
16  Worthington-Smyth, Henry        Smith, Tracy
17        Purview, Millicent        Smith, Tracy
18            Crumpet, Erica        Smith, Tracy
19               Baker, Anne    Stibbons, Ponder
20           Bader, Florence    Stibbons, Ponder
21          Stibbons, Ponder       Tracy, Burton

Q12: Find the facilities with their usage by member, but not guests

In [111]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT name, (firstname || ' ' || surname) AS member_name, count(surname) AS 'usage' \
FROM Bookings LEFT JOIN Facilities using(facid) LEFT JOIN Members using(memid) WHERE memid != 0 GROUP \
BY name, member_name;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

                name       member_name  usage
0    Badminton Court    Anna Mackenzie     30
1    Badminton Court        Anne Baker     10
2    Badminton Court      Burton Tracy      2
3    Badminton Court      Charles Owen      6
4    Badminton Court      Darren Smith    132
..               ...               ...    ...
197   Tennis Court 2  Ramnaresh Sarwin     11
198   Tennis Court 2        Tim Boothe     52
199   Tennis Court 2        Tim Rownam      6
200   Tennis Court 2     Timothy Baker      7
201   Tennis Court 2       Tracy Smith      2

[202 rows x 3 columns]

Q13: Find the facilities usage by month, but not guests

In [126]:
sql_connect = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = sql_connect.cursor()
query = "SELECT strftime('%m' , starttime) AS month, name, count(name) AS 'usage' FROM Bookings LEFT JOIN Facilities \
using(facid) WHERE memid != 0 GROUP BY month, name;"
results = cursor.execute(query).fetchall()
print(pd.read_sql_query(query,sql_connect))
sql_connect.close()

   month             name  usage
0     07  Badminton Court     51
1     07   Massage Room 1     77
2     07   Massage Room 2      4
3     07       Pool Table    103
4     07    Snooker Table     68
5     07     Squash Court     23
6     07     Table Tennis     48
7     07   Tennis Court 1     65
8     07   Tennis Court 2     41
9     08  Badminton Court    132
10    08   Massage Room 1    153
11    08   Massage Room 2      9
12    08       Pool Table    272
13    08    Snooker Table    154
14    08     Squash Court     85
15    08     Table Tennis    143
16    08   Tennis Court 1    111
17    08   Tennis Court 2    109
18    09  Badminton Court    161
19    09   Massage Room 1    191
20    09   Massage Room 2     14
21    09       Pool Table    408
22    09    Snooker Table    199
23    09     Squash Court     87
24    09     Table Tennis    194
25    09   Tennis Court 1    132
26    09   Tennis Court 2    126